Repository: CrystalNetwork-Studio/SimpleDictionary
Catalog: lib/l10n/app_*.arb
Languages: uk

source: About App
uk: Про додаток

# aboutAppDescription
source: A simple application for creating and managing personal dictionaries.
uk: Простий додаток для створення та керування особистими словниками.

# aboutAppNotReady
source: About app info is not ready yet.
uk: Інформація про додаток ще не готова.

source: Add Dictionary
uk: Додати словник

source: Add New Word
uk: Додати нове слово

# addWordsByPressingButton
source: Add words by pressing the '+' button at the bottom of the screen
uk: Додайте слова, натиснувши кнопку "+" внизу екрана

# anotherWordWithSameTermExists
source: Another word with the same term "{term}" / "{translation}" already exists.
uk: Інше слово з таким же терміном "{term}" / "{translation}" вже існує.

source: Appearance
uk: Вигляд

source: Author
uk: Автор

# baseDictionaryDirectoryCreated
source: Base 'Dictionary' directory created at: {baseDirPath}
uk: Базовий каталог 'Dictionary' створено за шляхом: {baseDirPath}

source: Cancel
uk: Відмінити

# cannotDeleteMainDictionaryDirectory
source: Error: Cannot delete the main 'Dictionary' directory. Dictionary name is blank.
uk: Помилка: Неможливо видалити головний каталог 'Dictionary'. Назва словника порожня.

source: Checking availability...
uk: Перевірка доступності...

source: Company
uk: Компанія

source: Confirm Deletion
uk: Підтвердити видалення

# confirmDeleteWord
source: Delete word "{wordName}"?
uk: Видалити слово "{wordName}"?

source: Create
uk: Створити

source: Create Dictionary
uk: Створити словник

# criticalErrorFailedToDeleteOldDictionary
source: CRITICAL: Failed to delete old directory '{oldName}' after renaming to '{newName}'. Manual cleanup might be needed.
uk: КРИТИЧНО: Не вдалося видалити стару версію словника. '{oldName}' після перейменування на '{newName}'. Можливо, потрібне ручне очищення.

source: Dark
uk: Темна

source: Data Management
uk: Керування Даними

source: Delete
uk: Видалити

source: Delete Dictionary?
uk: Видалити словник?

# deleteDictionaryConfirmation
source: Are you sure you want to delete the dictionary "{dictionaryName}"? This action cannot be undone.
uk: Ви впевнені, що хочете видалити словник "{dictionaryName}"? Цю дію неможливо скасувати.

source: Description
uk: Опис

source: Description (optional)
uk: Опис (необов'язково)

source: Dictionaries
uk: Словники

source: Dictionaries: {count}
uk: Словники: {count}

# dictionaryAlreadyExists
source: Dictionary with this name exists.
uk: Словник з такою назвою вже існує.

# dictionaryCreated
source: Dictionary "{dictionaryName}" created.
uk: Словник "{dictionaryName}" створено.

# dictionaryDeletedWithName
source: Dictionary "{dictionaryName}" deleted.
uk: Словник "{dictionaryName}" видалено.

# dictionaryEmpty
source: Dictionary is empty
uk: Словник порожній

# dictionaryFileNotFound
source: Dictionary file not found for '{dictionaryName}' at: {filePath}
uk: Файл словника не знайдено для '{dictionaryName}' за шляхом: {filePath}

# dictionaryMightBeDeleted
source: It might have been deleted.
uk: Можливо, його було видалено.

source: Dictionary Name
uk: Назва словника

# dictionaryNameHint
source: Enter dictionary name
uk: Введіть назву словника

# dictionaryNameLabel
source: Dictionary Name
uk: Назва словника

# dictionaryNameNotEmpty
source: Dictionary name cannot be empty.
uk: Назва словника не може бути порожньою.

source: Dictionary not found.
uk: Словник не знайдено.

# dictionaryNotFoundForDeletion
source: Dictionary '{dictionaryName}' not found for deletion.
uk: Словник '{dictionaryName}' не знайдено для видалення.

# dictionaryNotFoundForUpdate
source: Dictionary '{dictionaryName}' not found for update.
uk: Словник '{dictionaryName}' не знайдено для оновлення.

# dictionaryNotFoundForWordUpdate
source: Dictionary '{dictionaryName}' not found for word update.
uk: Словник '{dictionaryName}' не знайдено для оновлення слова.

# dictionarySavedTo
source: Dictionary '{dictionaryName}' saved to: {filePath}
uk: Словник '{dictionaryName}' збережено до: {filePath}

# dictionaryUpdated
source: Dictionary "{dictionaryName}" updated.
uk: Словник "{dictionaryName}" оновлено.

# dictionaryUpdatedWithName
source: Dictionary "{dictionaryName}" updated.
uk: Словник "{dictionaryName}" оновлено.

# directoryForDictionaryCreated
source: Directory for dictionary '{dictionaryName}' created at: {directoryPath}
uk: Каталог для словника '{dictionaryName}' створено за шляхом: {directoryPath}

# directoryForDictionaryNotFound
source: Directory for dictionary '{dictionaryName}' not found at: {directoryPath}
uk: Каталог для словника '{dictionaryName}' не знайдено за шляхом: {directoryPath}

source: Edit
uk: Редагувати

source: Edit Dictionary
uk: Редагувати словник

source: Edit Word
uk: Редагувати слово

# errorCheckingExistence
source: Error checking dictionary existence: {error}
uk: Помилка перевірки існування словника: {error}

# errorCreatingDictionary
source: Failed to create dictionary.
uk: Не вдалося створити словник.

# errorDeletingDictionary
source: Error deleting dictionary '{dictionaryName}'
uk: Помилка видалення словника '{dictionaryName}'

# errorDeletingDictionaryDirectory
source: Error deleting dictionary '{dictionaryName}': {error}
uk: Помилка видалення каталогу словника '{dictionaryName}': {error}

source: Error loading dictionaries
uk: Помилка завантаження словників

# errorLoadingDictionary
source: Error loading dictionary '{dictionaryName}': {error}
uk: Помилка завантаження словника '{dictionaryName}': {error}

# errorLoadingSettings
source: Error loading settings: {error}
uk: Помилка завантаження налаштувань: {error}

# errorListingDictionaryDirectories
source: Error listing dictionary directories: {error}
uk: Помилка переліку каталогів словників: {error}

# errorRemovingWord
source: Error removing word from '{dictionaryName}' at index {wordIndex}
uk: Помилка видалення слова з '{dictionaryName}' за індексом {wordIndex}

# errorSavingDictionary
source: Error saving dictionary '{dictionaryName}': {error}
uk: Помилка збереження словника '{dictionaryName}': {error}

# errorSavingThemeMode
source: Error saving theme mode: {error}
uk: Помилка збереження теми: {error}

# errorUpdatingWord
source: Error updating word in '{dictionaryName}' at index {wordIndex}
uk: Помилка оновлення слова в '{dictionaryName}' за індексом {wordIndex}

# errorValidatingName
source: Error validating name: {error}
uk: Помилка перевірки імені: {error}

# errorValidatingNameDialog
source: Error validating dictionary name.
uk: Помилка перевірки назви словника.

source: Failed to add word.
uk: Не вдалося додати слово.

source: Failed to delete word.
uk: Не вдалося видалити слово.

# failedToFindWordForEdit
source: Failed to find word for editing/deleting.
uk: Не вдалося знайти слово для редагування/видалення.

source: Failed to update dictionary.
uk: Не вдалося оновити словник.

source: Failed to update word.
uk: Не вдалося оновити слово.

source: Folder Color
uk: Колір папки

# foundDictionaryDirectories
source: Found dictionary directories: {dirNames}
uk: Знайдено каталоги словників: {dirNames}

source: Import / Export Dictionaries
uk: Імпорт / Експорт словників

# invalidWordIndexForDictionary
source: Invalid word index {wordIndex} for dictionary '{dictionaryName}'. Max index is {maxIndex}.
uk: Невірний індекс слова {wordIndex} для словника '{dictionaryName}'. Максимальний індекс: {maxIndex}.

source: Language
uk: Мова

# languageDrawer
source: Language: English
uk: Мова: Українська

# languageEnglish
source: English
uk: Англійська

# languageUkrainian
source: Ukrainian
uk: Українська

source: License
uk: Ліцензія

source: Light
uk: Світла

# maxLength20
source: Maximum 20 characters
uk: Максимум 20 символів

source: My Dictionaries
uk: Мої словники

# oopsImportExportNotReady
source: Import/Export feature is not ready yet. :(
uk: Функція Імпорту/Експорту ще не готова. :(

source: Options
uk: Опції

# pleaseEnterTranslation
source: Please enter a translation
uk: Будь ласка, введіть переклад

# pleaseEnterWord
source: Please enter a word
uk: Будь ласка, введіть слово

source: Save
uk: Зберегти

source: Settings
uk: Налаштування

# sortByAlphabetical
source: Sort Alphabetically
uk: Сортувати за алфавітом

source: Sort by Last Added
uk: Сортувати за останніми доданими

# successfullyDeletedDictionary
source: Successfully deleted dictionary '{dictionaryName}' at: {directoryPath}
uk: Словник '{dictionaryName}' успішно видалено за шляхом: {directoryPath}

source: System Default
uk: Системна

source: Theme
uk: Тема

source: Translation
uk: Переклад

source: Update Dictionary
uk: Оновити словник

source: Update Word
uk: Оновити слово

source: Version
uk: Версія

# wordAndTranslationMaxLength
source: Word and translation length cannot exceed 20 characters.
uk: Довжина слова та перекладу не може перевищувати 20 символів.

source: Word deleted
uk: Слово видалено

# wordDeletedWithName
source: Word "{wordName}" deleted
uk: Слово "{wordName}" видалено

# wordOrTranslationCannotBeEmpty
source: Word and translation cannot be empty.
uk: Слово та переклад не можуть бути порожніми.

source: Word updated successfully!
uk: Слово успішно оновлено!

source: Dictionary Type
uk: Тип словника

source: Word
uk: Слово

source: Words
uk: Слова

source: Sentence
uk: Речення

source: Sentences
uk: Фрази

# maxLengthValidation
source: Maximum length is {maxLength} characters
uk: Максимальна довжина: {maxLength} символів

# goBack
source: Back
uk: Назад
